# Homebrew baseline for macOS setup.
# Apply with: ./scripts/brew_install_all.sh
# Audit with: ./scripts/audit-brew.sh

tap "ibigio/tap"

brew "git"
brew "gh"
brew "fzf"
brew "tmux"
brew "node"
brew "pnpm"
brew "yarn"
brew "nvm"
brew "rye"
brew "uv"
brew "pipx"
brew "rustup"
brew "ibigio/tap/shell-ai"

cask "iterm2"
cask "google-chrome"
cask "visual-studio-code"
cask "cursor"
cask "font-fira-code"
cask "karabiner-elements"
cask "raycast"
cask "rectangle"
cask "contexts"
cask "hammerspoon"
cask "keyboard-maestro"
cask "thaw"
cask "logi-options-plus"
cask "hazeover"
cask "slack"
cask "google-drive"
cask "finicky"
cask "ticktick"
cask "docker"
